c18/linked_on_homework/app/views/users/show.html.erb


<% @user.skills.each do |r| %>
---
SELECT "skills".* FROM "skills" INNER JOIN "experiences" ON "skills"."id" = "experiences"."skill_id" WHERE "experiences"."user_id" = $1  [["user_id", 1]]