c18/linked_on_homework/app/controllers/companies_controller.rb

  def create
    @company = Company.new(company_params)

    if @company.save
---
INSERT INTO "companies" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Buckner Co"], ["created_at", "2015-05-16 06:21:29.641181"], ["updated_at", "2015-05-16 06:21:29.641181"]]