c18/linked_on_homework/app/controllers/experiences_controller.rb

  def create
    @experience = Experience.new(experience_params)
    @user = user_id
    if @experience.save
---
INSERT INTO "experiences" ("skill_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["skill_id", 2], ["user_id", 1], ["created_at", "2015-06-06 15:53:11.876417"], ["updated_at", "2015-06-06 15:53:11.876417"]]