c18/linked_on_homework/app/controllers/skills_controller.rb

  def create
    @skill = Skill.new(skill_params)

    if @skill.save
---
INSERT INTO "skills" ("skill_name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["skill_name", "Funky Dancing"], ["created_at", "2015-06-06 15:32:26.462600"], ["updated_at", "2015-06-06 15:32:26.462600"]]