c18/linked_on_homework/app/controllers/users_controller.rb

  def new
    @user = User.new
    @companies = Company.all
---
SELECT "companies".* FROM "companies"

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "email", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Dylan"], ["email", ""], ["company_id", 1], ["created_at", "2015-05-16 06:26:52.848135"], ["updated_at", "2015-05-16 06:26:52.848135"]]