c18/linked_on_homework/app/views/experiences/new.html.erb

SELECT "users".* FROM "users"
SELECT "skills".* FROM "skills"
---

<%= f.collection_select :user_id, User.all, :id, :name %>
  <br><br>
<%= f.collection_select :skill_id, Skill.all, :id, :skill_name %>